In [4]:
import pandas as pd

In [3]:
data = {
    "Name": ["Ali", "Hammad", "Sara"],
    "Age": [20, 22, 19],
    "City": ["Karachi", "Lahore", "Islamabad"]
}
df=pd.DataFrame(data)
df

     Name  Age       City
0     Ali   20    Karachi
1  Hammad   22     Lahore
2    Sara   19  Islamabad

In [5]:
df2 = pd.DataFrame(
    [[1,2,3],
     [4,5,6],
     [7,8,9]],
    columns=['A','B','C'],
    index=['Ai','Bi','Ci']
)

In [6]:
print("Head:\n",df2.head(3))
print("Tail:\n",df2.tail(2))

Head:
     A  B  C
Ai  1  2  3
Bi  4  5  6
Ci  7  8  9
Tail:
     A  B  C
Bi  4  5  6
Ci  7  8  9

In [ ]:
print(df2.columns)
print(df2.index)

Index(['A', 'B', 'C'], dtype='object')
Index(['Ai', 'Bi', 'Ci'], dtype='object')

In [54]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Ai to Ci
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0+ bytes

In [51]:
df2.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [61]:
print(df2.nunique())
print(df2['A'].unique())

A    2
B    2
C    2
dtype: int64
[1 2]

In [24]:
print(df2[['A','B']])
print(df2.loc[['Ai','Ci']])
print(df2.iloc[0])
print(df2[['B','C']].iloc[0])

    A  B
Ai  1  2
Bi  2  2
Ci  1  3
    A  B  C
Ai  1  2  3
Ci  1  3  9
A    1
B    2
C    3
Name: Ai, dtype: int64
B    2
C    3
Name: Ai, dtype: int64

In [26]:
print(df2.iloc[2, 0])

print(df2[['B','C']].iloc[0])

1
B    2
C    3
Name: Ai, dtype: int64

In [13]:
mask = df2['A'] > 3
print(mask)
df2[mask]

Ai    False
Bi     True
Ci     True
Name: A, dtype: bool

    A  B  C
Bi  4  5  6
Ci  7  8  9

In [22]:
df2[df2['B']<5]

    A  B  C
Ai  1  2  3

## Select a column after filtering

In [4]:
print(df2.loc[df2['A'] > 3, 'C'])
print(df2[df2['B']>2])
print(df2[df2['B']>1])

Bi    6
Ci    9
Name: C, dtype: int64
    A  B  C
Bi  4  5  6
Ci  7  8  9
    A  B  C
Ai  1  2  3
Bi  4  5  6
Ci  7  8  9

## Multiple conditions â€” & (AND), | (OR), ~ (NOT)

In [6]:
df2[(df2['B']>1) & df2['A']<6]
df2.loc[df2['B'].between(2,7), ['A','C']]

    A  C
Ai  1  3
Bi  4  6